#課題2 オイラーグラフか半オイラーグラフか確かめるプログラムを作成する。 
import pandas as pd 
 
rinsetu=[ 
    [0,1,0,0,0,1,0,0,0,0,0,0], 
    [1,0,1,1,1,0,0,0,0,0,0,0], 
    [0,1,0,0,0,0,1,0,0,0,0,0], 
    [0,1,0,0,1,1,0,1,0,0,0,0], 
    [0,1,0,1,0,0,1,1,1,0,0,0], 
    [1,0,0,1,0,0,0,1,0,1,0,0], 
    [0,0,1,0,1,0,0,0,1,0,0,1], 
    [0,0,0,1,1,1,0,0,1,0,1,0], 
    [0,0,0,0,1,0,1,1,0,0,1,0], 
    [0,0,0,0,0,1,0,0,0,0,1,0], 
    [0,0,0,0,0,0,0,1,1,1,0,1], 
    [0,0,0,0,0,0,1,0,0,0,1,0], 
 
] 
 
#オイラーグラフか半オイラーグラフ化判定 
count=0 
for i in range(len(rinsetu)): 
    #print(sum(rinsetu[i])) 
    if(sum(rinsetu[i])%2!=0): 
        count+=1 
if (count==2): 
    print("半オイラーグラフである。") 
elif(count==0): 
    print("オイラーグラフである。") 
else: 
    print("どちらでもない。") 
 
#df1=pd.DataFrame(rinsetu_gyouretu) 
#df1.index = ['v1','v2','v3','v4','v5','v6','v7','v8','v9','v10','v11','v12'] 
#df1.columns =['v1','v2','v3','v4','v5','v6','v7','v8','v9','v10','v11','v12'] 
 
#print(len(rinsetu)) 
#print(rinsetu[0][1])